# Homebrew Bundle - Modern Development Setup
# Install with: brew bundle install

#### SHELL ENHANCEMENTS ####
brew "starship"                      # Modern, fast prompt
brew "zsh-autosuggestions"           # Fish-like autosuggestions
brew "zsh-syntax-highlighting"       # Syntax highlighting for zsh
brew "fzf"                           # Fuzzy finder
brew "zoxide"                        # Smarter cd command

#### MODERN CLI REPLACEMENTS ####
brew "bat"                           # Better cat
brew "eza"                           # Better ls
brew "ripgrep"                       # Better grep
brew "fd"                            # Better find
brew "dust"                          # Better du
brew "procs"                         # Better ps
brew "git-delta"                     # Better git diff

#### SYSTEM MONITORING ####
brew "btop"                          # Better top (C++ version)
brew "htop"                          # Interactive process viewer
brew "asitop"                        # Performance monitor for Apple Silicon

#### DEVELOPER TOOLS ####
brew "git"                           # Version control
brew "gh"                            # GitHub CLI
brew "tmux"                          # Terminal multiplexer
brew "neovim"                        # Modern vim
brew "emacs"                         # Text editor
brew "jq"                            # JSON processor
brew "yq"                            # YAML/XML processor
brew "tree"                          # Directory tree viewer
brew "watch"                         # Execute command periodically
brew "pv"                            # Progress viewer for pipes

#### NETWORK TOOLS ####
brew "httpie"                        # User-friendly HTTP client
brew "wget"                          # Download utility
brew "nmap"                          # Network scanner

#### DEVELOPMENT RUNTIMES ####
brew "fnm"                           # Fast Node Manager
brew "pipx"                          # Install Python CLI apps in isolation
brew "watchman"                      # File watching service

#### AI & PRODUCTIVITY ####
# Note: claude-code is the primary AI CLI (install via: npm install -g @anthropic-ai/claude-code)
brew "gemini-cli"                    # Gemini CLI - backup for intractable issues
# Note: mlx-lm for local LLMs (install via: pipx install mlx-lm)
# Replaces ollama due to header bug in macOS 26.2

#### TESTING & UTILITIES ####
brew "stress-ng"                     # Stress testing tool

#### FONTS ####
cask "font-jetbrains-mono-nerd-font" # Nerd Font with programming ligatures
